---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.SpaceSeparationLinesOverlap
source: html/072b35eb-44b7-75f3-6a41-70cca19782e7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.SpaceSeparationLinesOverlap Property

Highlighted space separation lines overlap. One of them may be ignored when Revit finds space boundaries. Delete one of the lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpaceSeparationLinesOverlap { get; }
```